doc/diagram/gitcli.dot
digraph G {
    "vcs *" -> "user-lib *";
    "user-lib *" -> "executable (eio)";
    "git-cli" -> "vcs-git-provider";
    eio -> "vcs-git-provider";
    "vcs-git-provider" -> "executable (eio)";
}
