doc/diagram/stdlib.dot
digraph G {
    "vcs *" -> "user-lib *";
    "user-lib *" -> "executable (blocking)";
    "git-cli" -> "vcs-git-blocking";
    stdlib -> "vcs-git-blocking";
    "vcs-git-blocking" -> "executable (blocking)";
}
