doc/docs/design/introduction.md
```mermaid
stateDiagram-v2
  vcs : vcs *
  user : user-lib *
  vcs_git_cli : vcs-git-cli
  executable : executable (blocking)
  provider : vcs-git-blocking
  runtime : stdlib
  vcs --> user
  user --> executable
  vcs_git_cli --> provider
  runtime --> provider
  provider --> executable
```
